##########################################
# 과목명 : 데이터 애널리틱스
# 과제명 : 5 – LDA
# 이름 : 이주영
# 학번 : 2016111540
# 학과 : 경영학부                        
##########################################


############################################################
############################################################
# (문제1) alexa.Rdata 불러오기 
############################################################
############################################################
load('alexa.RData')

############################################################
############################################################ 
# (문제2) LDA 만들기 
############################################################
############################################################
library(topicmodels)
library(tidytext)
library(tidyr)
library(ggplot2)
library(dplyr)

alexa_lda <- LDA(alexa, 
                 k = 5, 
                 method = "Gibbs", 
                 control = list(seed = 5445))

alexa_lda


############################################################
############################################################
# (문제3) LDA 그래프 생성 
############################################################
############################################################
alexa_topics <- tidy(alexa_lda, matrix = "beta")

alexa_top_terms <- alexa_topics %>%
  group_by(topic) %>%
  top_n(10, beta) %>%
  ungroup() %>%
  arrange(topic, -beta)

alexa_top_terms %>%
  mutate(term = reorder_within(term, beta, topic)) %>%
  ggplot(aes(term, beta, fill = factor(topic))) + 
  geom_col(show.legend = TRUE) + 
  facet_wrap(~ topic, scales = "free") + 
  coord_flip() + 
  scale_x_reordered()

# RData 저장
# save.image(file = "HW#5(이주영).RData")
